// Домашня робота:
// Зробіть розрахунки і виведіть в консоль ось такі математичні операції
// let result1 = (5 + 3) * 2 - 7;
// let result2 = (10 / 2) ** 2;
// let result3 = 2 * (4 + 3) - (8 / 2);
// let result4 = (15 % 4) + 5;
// let result5 = 3 - (2 ** 4);
// Також свторіть 2 змінні і самостійно виведіть результат операцій +,-,*,/,%,**

let result1 = (5 + 3) * 2 - 7;
let result2 = (10 / 2) ** 2;
let result3 = 2 * (4 + 3) - (8 / 2);
let result4 = (15 % 4) + 5;
let result5 = 3 - (2 ** 4);
console.log(`(5 + 3) * 2 - 7 = ${result1}`);
console.log(`(10 / 2) ** 2 = ${result2}`);
console.log(`2 * (4 + 3) - (8 / 2) = ${result3}`);
console.log(`(15 % 4) + 5 = ${result4}`);
console.log(`3 - (2 ** 4) = ${result5}`);
let firstNumber =14;
let secondNumber = 9;
let thirdNumber = 2;
let mathOperation = firstNumber ** thirdNumber - secondNumber / thirdNumber;
console.log(`14 ** 2 - 9 / 2 = ${mathOperation}`);

// 1.Логічні порівняння та alert:
// Створіть змінні number1 та number2 і використайте оператори порівняння, щоб визначити, чи вони рівні.
// Виведіть результат за допомогою alert, щоб повідомити користувача про те, чи рівні числа.

let number1 = 7;
let nymber2 = 10;
alert(`${number1} == ${nymber2}: ${number1 == nymber2}`);
alert(`${number1} === ${nymber2}: ${number1 === nymber2}`);
alert(`${number1} != ${nymber2}: ${number1 != nymber2}`);
alert(`${number1} !== ${nymber2}: ${number1 !== nymber2}`);

// 2.Метод вводу інформації та логічні порівняння:
// Використовуючи prompt, запросіть у користувача введення числа.
// Перевірте, чи введене число парне чи непарне.
// Виведіть результат з використанням console.log.

let number = promtResult = prompt('Введіть число:');
console.log(`Число ${number} парне? ${number % 2 == 0 }`);

// 3. логічні порівняння та введення-виведення:
// Використовуючи prompt, запитайте у користувача його вік.
// Перевірте, чи вік менше 18 років.
// Виведіть відповідне повідомлення про те, чи може користувач використовувати певний ресурс.

let age = prompt("Введіть Ваш вік:");
console.log(`Вам вже виповнилося 18 років? ${age >= 18 ? 'Ви можете використовувати цей ресурс' : 'Ви не можете використовувати цей ресурс'}`);

// 4. Розрахунок вартості товару та console.log:
// Створіть змінну ціна та кількість товару і присвойте їм значення використовуючи prompt .
// Використовуйте математичні операції для обчислення вартості товару (ціна * кількість).
// Виведіть результат за допомогою console.log.

let price = prompt("Введіть ціну товару:");
let quantity = prompt("Введіть кількість товару:");
console.log(`Вартість товару: ${price * quantity}`);

// 5. Розрахунок знижки на товар та alert:
// Використовуючи prompt, запросіть в користувача вартість товару.
// Розрахуйте знижку на товар у розмірі 50% від введеної вартості.
// Виведіть результат знижки за допомогою alert.

let priceProduct = prompt("Введіть вартість товару:");
let discount = priceProduct * 0.5;
console.log(`Ціна товару зі знижкою: ${discount}`);