// Домашня робота:
// 1 Калькулятор 
// Створіть функції для кожної математичної операції (функцію сумми створена на уроці) 
//використовуючи switch  напишіть програму яка отримує знак математичної операції (+, -, /, *) та 2 значення і 
//запускає функцію для цієї математичної операції з 2 цифровими значеннями

// 2 Параметри та колбеки:
// Створіть функцію wellcomUser, яка приймає масив і функцію-колбек hiUser яка виводить в console ('Вітаю ${user}'), 
//і викликає цю функцію для кожного елемента масиву.

// 3 Знаходження першого парного числа:
// Напишіть програму, яка використовує цикл for для перебору чисел від 1 до 10 і виводить перше знайдене парне число. 
//Використайте оператор break, щоб припинити виконання циклу, якщо парне число знайдено.

// 4 Виведення парних чисел:
// Створіть програму, яка використовує цикл for для перебору массиву від 1 до 10 і виводить тільки парні числа. 
//Використайте оператор continue, щоб пропустити ітерації для непарних чисел.
